#!/bin/bash
mkdir -p /home/vagrant/Estructura_Asimetrica/{correo/{cartas_{1..100},carteros_{1..10}},clientes/cartas_{1..100}}
echo "-------------------------------------------------------------------------------------------------------------------------------------------------"
echo "Creando Estructura Asimétrica de directorios"
echo "-------------------------------------------------------------------------------------------------------------------------------------------------"
echo "Estructura Asimétrica de directorios: "
echo " "
tree Estructura_Asimetrica/ --noreport | pr -T -s' ' -w 80 --column 4
echo "-------------------------------------------------------------------------------------------------------------------------------------------------"
